[
  {
    "id": "senior-care-manager-london",
    "title": "Senior Care Manager",
    "location": "London, UK",
    "employment_type": "Full-time, Permanent",
    "contract_length": "Permanent",
    "working_hours": "38.5 hours/week",
    "salary": "Band 6",
    "salary_type": "Annual",
    "qualifications_required": "None mentioned",
    "experience_required": "Leadership or management role within a care setting",
    "soc_code": "1181",
    "posted_date": "2021-07-06",
    "closing_date": "2021-07-13",
    "apply_url": "https://yourdomain.com/apply/senior-care-manager-london",
    "sponsorship_available": false,
    "description": "<p>The Senior Care Manager is a key role within our organization, responsible for leading and supervising care teams to deliver high-quality person-centered care. This is a Band 6 position with a salary range of [INSERT SALARY RANGE HERE] and will report to [INSERT REPORTING LINE HERE].</p>\n\n<p>As the Senior Care Manager, you will be responsible for conducting assessments and developing comprehensive care plans, ensuring compliance with health and safety regulations and CQC standards. You will also be responsible for managing staff schedules and coordinating training programs, liaising with healthcare professionals, families, and external agencies, monitoring care delivery and implementing quality improvements, handling complex cases and providing clinical guidance to junior staff, and maintaining accurate records and preparing reports for management.</p>\n\n<p>The ideal candidate for this role will have experience in a leadership or management role within a care setting, with a strong knowledge of health and safety regulations and CQC standards. Excellent communication and interpersonal skills, as well as strong organizational and time-management abilities, are essential for success in this role. The ability to handle complex cases and provide clinical guidance is also a key requirement.</p>\n\n<ul>\n  <li>Competitive salary range of [INSERT SALARY RANGE HERE]</li>\n  <li>Full-time, permanent contract</li>\n  <li>Location: [INSERT LOCATION HERE]</li>\n</ul>",
    "logo": null
  },
  {
    "id": "healthcare-assistant-city-uk",
    "title": "Healthcare Assistant",
    "location": "City, UK",
    "employment_type": "Full-time, Permanent",
    "contract_length": "Permanent",
    "working_hours": "38.5 hours/week",
    "salary": "Band 3",
    "salary_type": "Annual",
    "qualifications_required": "NVQ Level 2 or 3 in Health and Social Care",
    "experience_required": "Experience working in a care home or similar setting",
    "soc_code": "6145",
    "posted_date": "2021-07-06",
    "closing_date": "2021-07-13",
    "apply_url": "https://yourdomain.com/apply/healthcare-assistant-city-uk",
    "sponsorship_available": false,
    "description": "<p> \nThe Healthcare Assistant will be responsible for providing personal care to residents in a care home setting. This includes assisting with daily tasks such as washing, dressing, and mobility assistance, as well as administering medications under supervision. The role also involves monitoring and recording vital signs and health observations, assisting with meal preparation and feeding support, maintaining accurate care records and incident reports, and supporting residents with social activities and companionship. The Healthcare Assistant must ensure compliance with health and safety regulations at all times.\n</p>\n<p>\nKey responsibilities of this role include providing personal care to residents, administering medications under supervision, and monitoring and recording vital signs and health observations. The Healthcare Assistant will also assist with meal preparation and feeding support, maintain accurate care records and incident reports, and support residents with social activities and companionship. This role reports to the care home manager.\n</p>\n<p>\nThe ideal candidate will have experience working in a care home or similar setting, the ability to provide personal care to residents, and basic knowledge of administering medications. They must also possess excellent communication and interpersonal skills, the ability to maintain accurate records and reports, and an understanding of health and safety regulations. Desirable qualifications and experience include NVQ Level 2 or 3 in Health and Social Care, experience working with elderly or vulnerable individuals, first aid certification, and experience with meal preparation and feeding support.\n</p>\n<ul>\n<li>Competitive salary in Band 3</li>\n<li>Full-time, permanent position</li>\n<li>Located in a care home setting</li>\n</ul>",
    "logo": null
  },
  {
    "id": "deputy-care-manager-city-uk",
    "title": "Deputy Care Manager",
    "location": "City, UK",
    "employment_type": "Full-time, Permanent",
    "contract_length": "Permanent",
    "working_hours": "38.5 hours/week",
    "salary": "£32,000 - £38,000 per annum",
    "salary_type": "Annual",
    "qualifications_required": "NVQ Level 4 or above in Health and Social Care",
    "experience_required": "Experience in a supervisory or management role in a care setting, knowledge of CQC regulations and company policies, experience in budget oversight and resource management, experience in staff training and development",
    "soc_code": "3219",
    "posted_date": "2021-07-07",
    "closing_date": "2021-07-14",
    "apply_url": "https://yourdomain.com/apply/deputy-care-manager-city-uk",
    "sponsorship_available": false,
    "description": "<p> \nThe Deputy Care Manager will support the Care Manager in overseeing daily operations and staff supervision. This role requires excellent communication and interpersonal skills, as well as strong leadership and team management abilities. The Deputy Care Manager will be responsible for conducting staff appraisals and performance management, ensuring compliance with CQC regulations and company policies, managing staff rotas and coordinating cover arrangements, handling complaints and safeguarding investigations, liaising with external professionals, maintaining budget oversight and resource management, and leading staff training and development programs. This is a full-time, permanent position located in the UK, with a salary band of £32,000 - £38,000. \n</p>\n\n<p> \nKey responsibilities of the Deputy Care Manager include supporting the Care Manager in daily operations and staff supervision, conducting staff appraisals and performance management, ensuring compliance with CQC regulations and company policies, managing staff rotas and coordinating cover arrangements, handling complaints and safeguarding investigations, and liaising with external professionals. This role reports to the Care Manager and requires experience in a supervisory or management role in a care setting, as well as knowledge of CQC regulations and company policies. \n</p>\n\n<p> \nThe ideal candidate for this role should have experience in a supervisory or management role in a care setting, knowledge of CQC regulations and company policies, excellent communication and interpersonal skills, strong leadership and team management abilities, experience in budget oversight and resource management, and experience in staff training and development. Desirable qualifications include an NVQ Level 4 or above in Health and Social Care and experience in conducting staff appraisals and performance management, coordinating staff rotas and cover arrangements, and liaising with external professionals. \n</p>\n\n<ul> \n<li>Full-time, permanent position</li> \n<li>Salary band of £32,000 - £38,000</li> \n<li>Located in the UK</li> \n</ul>",
    "logo": null
  },
  {
    "id": "senior-care-worker-city-uk",
    "title": "Senior Care Worker",
    "location": "City, UK",
    "employment_type": "Full-time, Permanent",
    "contract_length": "Permanent",
    "working_hours": "38.5 hours/week",
    "salary": "Band 4",
    "salary_type": "Annual",
    "qualifications_required": "NVQ Level 3 in Health and Social Care",
    "experience_required": "Experience in a senior or leadership role",
    "soc_code": "6145",
    "posted_date": "2021-08-02",
    "closing_date": "2021-08-09",
    "apply_url": "https://yourdomain.com/apply/senior-care-worker-city-uk",
    "sponsorship_available": false,
    "description": "<p>The Senior Care Worker will be responsible for overseeing and mentoring other care staff, developing and implementing care plans, administering medication (under supervision), and assisting with daily living activities. This role requires a compassionate and dedicated individual who is able to provide high-quality care to vulnerable individuals. The role falls under SOC Code 6145 with a salary band of Band 4.</p>\n\n<p>The key responsibilities of the Senior Care Worker include overseeing and mentoring other care staff, developing and implementing care plans, administering medication under supervision, and assisting with daily living activities. The role reports to the Care Manager.</p>\n\n<p>The ideal candidate for this role will have experience working in a care setting, strong communication and interpersonal skills, the ability to work well in a team, and an understanding of health and safety regulations. They must also be able to administer medication under supervision. Desirable criteria for this role include an NVQ Level 3 in Health and Social Care, experience in a senior or leadership role, experience with developing care plans, and experience with assisting with daily living activities.</p>\n\n<ul>\n  <li>Competitive salary in Band 4</li>\n  <li>Full-time, permanent contract</li>\n  <li>Located in the UK</li>\n</ul>",
    "logo": null
  }
]