[
  {
    "id": "deputy-care-manager-city-uk",
    "title": "Deputy Care Manager",
    "location": "City, UK",
    "employment_type": "Full-time, Permanent",
    "contract_length": "Permanent",
    "working_hours": "38.5 hours/week",
    "salary": "£32,000 - £38,000 per annum",
    "salary_type": "Annual",
    "qualifications_required": "NVQ Level 4 or above in Health and Social Care",
    "experience_required": "Experience in a supervisory or management role in a care setting, knowledge of CQC regulations and company policies, experience in budget oversight and resource management, experience in staff training and development",
    "soc_code": "3219",
    "posted_date": "2021-07-07",
    "closing_date": "2021-07-14",
    "apply_url": "https://yourdomain.com/apply/deputy-care-manager-city-uk",
    "sponsorship_available": false,
    "description": "<p> \nThe Deputy Care Manager will support the Care Manager in overseeing daily operations and staff supervision. This role requires excellent communication and interpersonal skills, as well as strong leadership and team management abilities. The Deputy Care Manager will be responsible for conducting staff appraisals and performance management, ensuring compliance with CQC regulations and company policies, managing staff rotas and coordinating cover arrangements, handling complaints and safeguarding investigations, liaising with external professionals, maintaining budget oversight and resource management, and leading staff training and development programs. This is a full-time, permanent position located in the UK, with a salary band of £32,000 - £38,000. \n</p>\n\n<p> \nKey responsibilities of the Deputy Care Manager include supporting the Care Manager in daily operations and staff supervision, conducting staff appraisals and performance management, ensuring compliance with CQC regulations and company policies, managing staff rotas and coordinating cover arrangements, handling complaints and safeguarding investigations, and liaising with external professionals. This role reports to the Care Manager and requires experience in a supervisory or management role in a care setting, as well as knowledge of CQC regulations and company policies. \n</p>\n\n<p> \nThe ideal candidate for this role should have experience in a supervisory or management role in a care setting, knowledge of CQC regulations and company policies, excellent communication and interpersonal skills, strong leadership and team management abilities, experience in budget oversight and resource management, and experience in staff training and development. Desirable qualifications include an NVQ Level 4 or above in Health and Social Care and experience in conducting staff appraisals and performance management, coordinating staff rotas and cover arrangements, and liaising with external professionals. \n</p>\n\n<ul> \n<li>Full-time, permanent position</li> \n<li>Salary band of £32,000 - £38,000</li> \n<li>Located in the UK</li> \n</ul>",
    "logo": null
  },
  {
    "id": "senior-care-worker-city-uk",
    "title": "Senior Care Worker",
    "location": "City, UK",
    "employment_type": "Full-time, Permanent",
    "contract_length": "Permanent",
    "working_hours": "38.5 hours/week",
    "salary": "Band 4",
    "salary_type": "Annual",
    "qualifications_required": "NVQ Level 3 in Health and Social Care",
    "experience_required": "Experience in a senior or leadership role",
    "soc_code": "6145",
    "posted_date": "2021-08-02",
    "closing_date": "2021-08-09",
    "apply_url": "https://yourdomain.com/apply/senior-care-worker-city-uk",
    "sponsorship_available": false,
    "description": "<p>The Senior Care Worker will be responsible for overseeing and mentoring other care staff, developing and implementing care plans, administering medication (under supervision), and assisting with daily living activities. This role requires a compassionate and dedicated individual who is able to provide high-quality care to vulnerable individuals. The role falls under SOC Code 6145 with a salary band of Band 4.</p>\n\n<p>The key responsibilities of the Senior Care Worker include overseeing and mentoring other care staff, developing and implementing care plans, administering medication under supervision, and assisting with daily living activities. The role reports to the Care Manager.</p>\n\n<p>The ideal candidate for this role will have experience working in a care setting, strong communication and interpersonal skills, the ability to work well in a team, and an understanding of health and safety regulations. They must also be able to administer medication under supervision. Desirable criteria for this role include an NVQ Level 3 in Health and Social Care, experience in a senior or leadership role, experience with developing care plans, and experience with assisting with daily living activities.</p>\n\n<ul>\n  <li>Competitive salary in Band 4</li>\n  <li>Full-time, permanent contract</li>\n  <li>Located in the UK</li>\n</ul>",
    "logo": null
  },
  {
    "id": "general-assistant-city-uk",
    "title": "General Assistant",
    "location": "City, UK",
    "employment_type": "Full-time, Permanent",
    "contract_length": "Permanent",
    "working_hours": "38.5 hours/week",
    "salary": "Band 4",
    "salary_type": "Annual",
    "qualifications_required": "None mentioned",
    "experience_required": "Previous experience in an administrative or support role",
    "soc_code": "4119",
    "posted_date": "2021-07-05",
    "closing_date": "2021-07-12",
    "apply_url": "https://yourdomain.com/apply/general-assistant-city-uk",
    "sponsorship_available": false,
    "description": "<p> \n    <strong>General Assistant</strong> \n</p> \n<p> \n    We are currently seeking a General Assistant to join our team. This role is responsible for providing administrative, clerical, and logistical support to ensure the smooth and efficient operation of our office, department, or organization. The ideal candidate will have excellent organizational and time-management skills, as well as strong communication and interpersonal abilities. This is a full-time, permanent position located in the UK. The salary for this role falls within Band 4 according to the SOC Code 4119. \n</p> \n<p> \n    As a General Assistant, you will be responsible for scheduling meetings, managing correspondence, maintaining files, and assisting with various projects. You may also handle customer service, stock management, and basic cleaning duties. This role reports to the [insert job title/department]. \n</p> \n<p> \n    To be considered for this role, candidates must have excellent organizational and time-management skills. Strong communication and interpersonal abilities are also essential. Previous experience in an administrative or support role is desirable, as well as basic knowledge of customer service principles. \n</p> \n<ul> \n    <li>Full-time, permanent position</li> \n    <li>Located in the UK</li> \n    <li>Salary within Band 4 according to SOC Code 4119</li> \n</ul>",
    "logo": null
  },
  {
    "id": "care-worker-city-uk",
    "title": "Care Worker",
    "location": "City, UK",
    "employment_type": "Full-time, Permanent",
    "contract_length": "Permanent",
    "working_hours": "38.5 hours/week",
    "salary": "Band 4",
    "salary_type": "Annual",
    "qualifications_required": "Formal training or certification in care assistance",
    "experience_required": "Experience in providing personal care and support to individuals",
    "soc_code": "6145",
    "posted_date": "2021-07-15",
    "closing_date": "2021-07-22",
    "apply_url": "https://yourdomain.com/apply/care-worker-city-uk",
    "sponsorship_available": false,
    "description": "<p>\n    <strong>Care Worker - Band 4</strong>\n</p>\n<p>\n    We are currently seeking a compassionate and dedicated Care Worker to join our team. As a Care Worker, you will provide personal care, practical support, and emotional assistance to individuals in their homes or in residential care settings. Your role will involve assisting with daily living activities, providing companionship, and monitoring a person's condition.\n</p>\n<p>\n    Reporting to the Care Manager, your key responsibilities will include assisting with personal hygiene, dressing, and eating, as well as providing emotional support and companionship. You will also be responsible for household tasks and medication administration, ensuring the safety and well-being of our clients.\n</p>\n<p>\n    <strong>Candidate Requirements:</strong>\n</p>\n<ul>\n    <li>Experience in providing personal care and support to individuals</li>\n    <li>Ability to assist with daily living activities, such as personal hygiene, dressing, and eating</li>\n    <li>Excellent communication and interpersonal skills</li>\n    <li>Ability to provide emotional support and companionship</li>\n    <li>Basic knowledge of household tasks and medication administration</li>\n</ul>\n<p>\n    <strong>Benefits:</strong>\n</p>\n<ul>\n    <li>Competitive salary based on Band 4</li>\n    <li>Full-time, permanent contract</li>\n    <li>Location: various locations in the UK</li>\n</ul>",
    "logo": null
  }
]