[
  {
    "id": "care-team-coordinator-city-uk",
    "title": "Care Team Coordinator",
    "location": "City, UK",
    "employment_type": "Full-time, Permanent",
    "contract_length": "Permanent",
    "working_hours": "38.5 hours/week",
    "salary": "£25,000 - £28,000 per annum",
    "salary_type": "Annual",
    "qualifications_required": "None mentioned",
    "experience_required": "None mentioned",
    "soc_code": "3219",
    "posted_date": "None mentioned",
    "closing_date": "None mentioned",
    "apply_url": "https://yourdomain.com/apply/care-team-coordinator-city-uk",
    "sponsorship_available": false,
    "description": "<p>The Care Team Coordinator will be responsible for coordinating scheduling for care staff, supervising care plans and ensuring compliance, serving as the main point of contact between clients and staff, and updating digital care logs and managing staff documentation. This role is classified under SOC Code 3219 and falls within the salary band of £25,000 – £28,000.</p>\n\n<p>Key responsibilities of this role include coordinating schedules and managing staff, ensuring compliance with care industry regulations and standards, serving as the main point of contact between clients and staff, and maintaining digital care logs and staff documentation. The Care Team Coordinator will report to the management team and work closely with both clients and care staff.</p>\n\n<p>The ideal candidate for this role will have excellent organizational and time management skills, as well as strong communication and interpersonal skills. Previous experience in a similar role and knowledge of care industry regulations and standards are desirable criteria.</p>\n\n<ul>\n\t<li>Competitive salary range of £25,000 – £28,000</li>\n\t<li>Full-time, permanent contract</li>\n\t<li>Located in the UK</li>\n</ul>",
    "logo": null
  },
  {
    "id": "support-worker-leeds-uk",
    "title": "Support Worker",
    "location": "Leeds, UK",
    "employment_type": "Full-time, Permanent",
    "contract_length": "Permanent",
    "working_hours": "Flexible shifts, including nights and weekends",
    "salary": "Band 4",
    "salary_type": "Annual",
    "qualifications_required": "NVQ Level 2 in Health and Social Care",
    "experience_required": "Minimum 6 months experience in a support or care role",
    "soc_code": "6121",
    "posted_date": "2021-06-26",
    "closing_date": "2021-07-24",
    "apply_url": "https://yourdomain.com/apply/support-worker-leeds-uk",
    "sponsorship_available": false,
    "description": "<p>We are currently seeking a dedicated and empathetic Support Worker to join our team in Leeds. In this role, you will provide daily care and assistance to individuals with learning disabilities, autism, or mental health conditions, enabling them to live as independently as possible. This is a full-time, permanent position with a salary band of Band 4, as per the SOC Code 6121.</p>\n\n<p>Key responsibilities of the Support Worker include assisting with personal care, household tasks, medication administration, and supporting clients with social integration and appointments. You will report to the Team Leader and work in supported living settings across Leeds.</p>\n\n<p>To be considered for this role, you must have a minimum of 6 months experience in a support or care role and have excellent communication and interpersonal skills. A NVQ Level 2 in Health and Social Care is preferred, but not required. The ability to work flexible shifts, including nights and weekends, and the right to work in the UK are also essential. A good understanding of safeguarding and person-centred care is also required.</p>\n\n<ul>\n    <li>Competitive salary in Band 4</li>\n    <li>Full-time, permanent position</li>\n    <li>Opportunities for career development and progression</li>\n</ul>",
    "logo": null
  },
  {
    "id": "care-team-coordinator-city-uk",
    "title": "Care Team Coordinator",
    "location": "City, UK",
    "employment_type": "Full-time, Permanent",
    "contract_length": "Permanent",
    "working_hours": "38.5 hours/week",
    "salary": "£25,000 - £28,000 per annum",
    "salary_type": "Annual",
    "qualifications_required": "None mentioned",
    "experience_required": "None mentioned",
    "soc_code": "3219",
    "posted_date": "Not mentioned",
    "closing_date": "Not mentioned",
    "apply_url": "https://yourdomain.com/apply/care-team-coordinator-city-uk",
    "sponsorship_available": "False",
    "description": "<p>The Care Team Coordinator plays a vital role in our organization, ensuring that our clients receive the best possible care. This position requires excellent organizational and time management skills, as well as strong communication and interpersonal skills. The successful candidate will be responsible for coordinating schedules for care staff, supervising care plans and ensuring compliance, serving as the main point of contact between clients and staff, and updating digital care logs and managing staff documentation.</p>\n\n<p>As the Care Team Coordinator, you will report to the management team and work closely with our care staff. Your key responsibilities will include coordinating schedules and managing staff, ensuring compliance with care industry regulations and standards, and handling client-staff interactions. You will also be responsible for updating digital care logs and managing staff documentation.</p>\n\n<p>To be considered for this role, candidates must possess excellent organizational and time management skills, as well as strong communication and interpersonal skills. Previous experience in a similar role would be desirable, along with knowledge of care industry regulations and standards.</p>\n\n<ul>\n  <li>Competitive salary in the range of £25,000 – £28,000</li>\n  <li>Full-time, permanent contract</li>\n  <li>Located in the UK</li>\n</ul>",
    "logo": null
  },
  {
    "id": "senior-care-worker-city-uk",
    "title": "Senior Care Worker",
    "location": "City, UK",
    "employment_type": "Full-time, Permanent",
    "contract_length": "Permanent",
    "working_hours": "38.5 hours/week",
    "salary": "Band 4",
    "salary_type": "Hourly",
    "qualifications_required": "NVQ Level 3 in Health and Social Care",
    "experience_required": "Experience in a senior or leadership role",
    "soc_code": "6145",
    "posted_date": "2021-07-01",
    "closing_date": "2021-07-08",
    "apply_url": "https://yourdomain.com/apply/senior-care-worker-city-uk",
    "sponsorship_available": "True",
    "description": "<p>The Senior Care Worker will be responsible for overseeing and mentoring other care staff, developing and implementing care plans, administering medication (under supervision), and assisting with daily living activities. This role requires a compassionate and dedicated individual who is able to provide high-quality care to vulnerable individuals. The successful candidate will join our team on a full-time, permanent basis, with a salary range of Band 4 as per SOC Code 6145.</p>\n\n<p>Key responsibilities of the Senior Care Worker include:</p>\n<ul>\n  <li>Overseeing and mentoring other care staff</li>\n  <li>Developing and implementing care plans</li>\n  <li>Administering medication under supervision</li>\n  <li>Assisting with daily living activities</li>\n</ul>\n<p>The Senior Care Worker will report to the Care Manager and work closely with other care staff to ensure the safety and well-being of our patients. The successful candidate must have experience working in a care setting, strong communication and interpersonal skills, and the ability to work well in a team. They must also have a good understanding of health and safety regulations and be able to administer medication under supervision.</p>\n\n<p>The ideal candidate will also have:</p>\n<ul>\n  <li>NVQ Level 3 in Health and Social Care</li>\n  <li>Experience in a senior or leadership role</li>\n  <li>Experience with developing care plans</li>\n  <li>Experience with assisting with daily living activities</li>\n</ul>\n\n<p>Benefits:</p>\n<ul>\n  <li>Full-time, permanent contract</li>\n  <li>Competitive salary range of Band 4 as per SOC Code 6145</li>\n  <li>Opportunities for career development and progression</li>\n</ul>",
    "logo": null
  }
]